<template>
  <div>
    <van-collapse v-model="activeNames" :border="border">
      <van-collapse-item name="1" :border="border">
        <template #title>
          <div style="height:12.5vw;margin:0;padding:0">
            <div class="video-info">
              <span
                ><svg
                  style="position:relative; top:0.556vw;"
                  t="1597412026935"
                  class="icon"
                  viewBox="0 0 1024 1024"
                  version="1.1"
                  xmlns="http://www.w3.org/2000/svg"
                  p-id="2003"
                  width="3.889vw"
                  height="3.889vw"
                >
                  <path
                    d="M359.936 947.712c-2.56 0-5.12-0.512-7.168-1.536-3.072-1.536-329.728-133.12-228.864-406.016C147.456 476.672 179.2 435.712 202.24 406.016c26.112-33.28 37.376-49.152 30.208-70.656-3.072-8.192 0.512-17.92 8.192-23.04 7.68-4.608 17.92-3.584 24.576 3.072 1.536 1.536 25.088 25.6 43.52 56.32C363.008 291.328 453.632 138.752 435.712 76.8c-2.048-7.68 0.512-15.872 6.656-20.992 6.144-5.12 14.848-5.632 22.016-2.048 7.168 3.584 166.4 91.136 242.176 254.976 7.68-12.8 12.288-34.304 1.024-68.096-3.072-8.704 0.512-18.432 8.192-23.04 7.68-5.12 17.92-4.096 24.576 2.56 8.192 8.192 205.312 201.216 179.712 417.28-13.824 115.712-89.088 214.528-224.256 293.888-7.168 4.096-15.872 3.584-22.528-1.536-6.656-5.12-9.216-13.312-7.168-21.504 1.024-3.072 85.504-306.688-120.32-467.968-7.168 52.736-30.72 151.552-112.64 223.232-51.712 45.056-82.432 105.984-84.48 166.912-1.024 35.328 8.192 66.048 24.576 82.432 6.656 6.656 7.68 16.896 2.56 25.088-3.072 6.144-9.216 9.728-15.872 9.728zM267.264 380.416c-7.68 16.896-19.968 33.28-33.792 50.176-23.04 29.184-51.2 65.536-72.192 123.392-64.512 175.616 73.216 283.648 154.112 329.728-4.096-16.384-5.632-34.816-5.12-53.76 2.56-71.68 38.4-143.36 98.304-195.584C508.928 545.792 509.952 405.504 509.952 404.48c0-7.168 4.096-13.824 10.24-17.408 6.144-3.584 14.336-3.072 20.48 0.512 207.872 133.632 192 380.928 174.592 484.352 98.816-67.584 154.624-148.48 165.376-239.616 16.384-138.752-73.216-271.872-127.488-338.944-5.632 37.376-28.16 59.392-44.544 67.584-5.12 2.56-10.752 2.56-15.872 0.512s-9.216-6.144-11.264-11.264c-47.616-123.904-152.064-206.336-204.288-242.176C465.92 220.16 338.432 399.872 322.048 422.4c-4.608 6.144-11.776 9.216-18.944 8.192-7.168-1.024-13.312-6.144-15.872-13.312-4.608-12.288-12.288-25.088-19.968-36.864z"
                    fill="#FB7299"
                    p-id="2004"
                  ></path></svg
                >{{ title }}</span
              >
              <span>{{ name }}</span>
            </div>
            <div class="user-info">
              <span
                ><svg
                  t="1597415524920"
                  style="position:relative; top:0.833vw;"
                  class="icon"
                  viewBox="0 0 1024 1024"
                  version="1.1"
                  xmlns="http://www.w3.org/2000/svg"
                  p-id="1724"
                  width="4.444vw"
                  height="4.444vw"
                >
                  <path
                    d="M800 128H224C134.4 128 64 198.4 64 288v448c0 89.6 70.4 160 160 160h576c89.6 0 160-70.4 160-160V288c0-89.6-70.4-160-160-160z m96 608c0 54.4-41.6 96-96 96H224c-54.4 0-96-41.6-96-96V288c0-54.4 41.6-96 96-96h576c54.4 0 96 41.6 96 96v448z"
                    p-id="1725"
                    fill="#212121"
                  ></path>
                  <path
                    d="M419.2 544c0 51.2-3.2 108.8-83.2 108.8S252.8 595.2 252.8 544v-217.6H192v243.2c0 96 51.2 140.8 140.8 140.8 89.6 0 147.2-48 147.2-144v-240h-60.8V544zM710.4 326.4h-156.8V704h60.8v-147.2h96c102.4 0 121.6-67.2 121.6-115.2 0-44.8-19.2-115.2-121.6-115.2z m-3.2 179.2h-92.8V384h92.8c32 0 60.8 12.8 60.8 60.8 0 44.8-32 60.8-60.8 60.8z"
                    p-id="1726"
                    fill="#212121"
                  ></path>
                </svg>
                {{ username }}
              </span>
              <span>
                1314万观看
              </span>
              <span>
                2.6万弹幕
              </span>
              <span>
                {{ date }}
              </span>
            </div>
          </div>
        </template>
        <div class="display">
          <div style="font-size:3.333vw">
            <svg
            style="position:relative; top:2px;"
              t="1597416589688"
              class="icon"
              viewBox="0 0 1024 1024"
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              p-id="1585"
              width="3.333vw"
              height="3.333vw"
            >
              <path
                d="M164.864 795.226353l632.470588-632.470588 63.909647 63.849411-632.470588 632.530824z"
                fill="#FB7299"
                p-id="1586"
              ></path>
              <path
                d="M1024 512c0 283.105882-228.894118 512-512 512S0 795.105882 0 512 228.894118 0 512 0s512 228.894118 512 512zM90.352941 512c0 231.905882 189.741176 421.647059 421.647059 421.647059s421.647059-189.741176 421.647059-421.647059S743.905882 90.352941 512 90.352941 90.352941 280.094118 90.352941 512z"
                fill="#FB7299"
                p-id="1587"
              ></path>
            </svg>
            未经作者授权禁止转载
          </div>
          <div>
            大家喜欢这个视频的话可以一键三连支持哦~<br>
            大家还可以关注这个频道<br>
            欢迎大家关注我！<br>
            不定期有惊喜哦！<br>
            感谢支持！
          </div>
        </div>
      </van-collapse-item>
    </van-collapse>

  </div>
</template>

<script>
export default {
  name: "ArticleDetail",
  data() {
    return {
      activeNames: [],
      border: false,
    };
  },
  props: ["title", "name", "username", "date"],
  methods: {
    showMsg(){
      this.$msg.fail('此功能未实现，敬请期待')
    }
  },
};
</script>

<style>
.video-info {
  display: flex;
  align-items: center;
}
.video-info span:nth-child(1) {
  color: #fa72a5;
  font-size: 3.333vw;
  background-color: #f4f4f4;
  padding: 0 0.833vw;
  border-radius: 2.778vw;
}
.video-info span:nth-child(2) {
  color: black;
  font-size: 3.889vw;
  margin-left: 2.778vw;
}
.user-info {
  display: flex;
  align-items: center;
  margin: 2.778vw 1.111vw;
}
.user-info span:nth-child(1) {
  color: #212121;
  font-size: 3.333vw;
}
.user-info span:nth-child(2) {
  color: #9999a6;
  font-size: 3.333vw;
  margin-left: 2.778vw;
  /* padding: 10px 0px; */
}
.user-info span:nth-child(3) {
  color: #9999a6;
  font-size: 3.333vw;
  margin-left: 2.778vw;
}
.user-info span:nth-child(4) {
  color: #9999a6;
  font-size: 3.333vw;
  margin-left: 2.778vw;
}
.display div:nth-child(2){
  color: #999999;
  margin: 1.667vw 0;
  font-size: 3.333vw;
}
.btn{
  margin: 1.389vw 5vw;
  display: flex;
  align-items: center;
  justify-content: space-between;
}
.btn span{
  font-size: 2.778vw;
}
</style>
